Revit 2027 API
BuiltInFailures.StairRampFailures.NotEnoughRisers Property
 Actual Number of Risers is different from Desired Number of Risers. Add/remove Risers or change Desired Number of Risers in Stairs Properties.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotEnoughRisers { get; }
Public Shared ReadOnly Property NotEnoughRisers As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotEnoughRisers {
	FailureDefinitionId^ get ();
}
static member NotEnoughRisers : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace